"use client";

import styles from "./page.module.css";

export default function AboutUs() {
  return (
    <main className={styles.mainWrapper}>
      <section className={styles.contentWrapper}>
        <section className={styles.blueTheme}>
          <h2 className={styles.title}>ПРО НАС</h2>
        </section>

        <section>
          <div className={styles.container}>
            <p>
              Ласкаво просимо до інтернет-магазину{" "}
              <strong>«miydim.shop»</strong>! Тут ви знайдете найкращі товари
              для дому, що створять затишок, комфорт і гармонію у вашому
              просторі.
            </p>

            <p>
              <strong>Чому варто обрати саме нас?</strong>
              <br />
              Дочитайте цей текст до кінця, і у вас не залишиться жодних
              сумнівів!
            </p>

            <p>
              <strong>Наші переваги:</strong>
            </p>

            <p>
              <strong>Вибір продукції з урахуванням потреб клієнтів.</strong>
              <br />
              Перед тим як представити товари у продажу, ми детально аналізуємо
              ринок і потреби покупців. Ми знаємо, що ви шукаєте найкраще
              поєднання якості, стилю та розумної ціни.
            </p>

            <p>
              <strong>Постійне оновлення асортименту.</strong>
              <br />
              Ми регулярно поповнюємо каталог новими товарами, орієнтуючись на
              тренди та ваші запити.
            </p>

            <p>
              <strong>Надійні виробники та постачальники.</strong>
              <br />
              Ми співпрацюємо лише з перевіреними брендами, які гарантують
              високу якість продукції. Наші товари – це довговічність,
              екологічність та бездоганний зовнішній вигляд.
            </p>

            <p>
              <strong>Високий рівень обслуговування.</strong>
              <br />
              Ми прагнемо зробити кожну покупку приємною та безпроблемною. Наші
              менеджери завжди готові допомогти вам з вибором та відповісти на
              всі запитання.
            </p>

            <p>
              <strong>Великий вибір товарів.</strong>
              <br />У нас представлено широкий асортимент продукції для різних
              стилів інтер&apos;єру, потреб та бюджетів.
            </p>

            <p>
              <strong>Зручна доставка та різні способи оплати.</strong>
              <br />
              Ми подбали про те, щоб ви могли швидко отримати своє замовлення у
              зручний для вас спосіб. Деталі про умови доставки та оплати ви
              можете знайти у відповідному розділі нашого сайту.
            </p>

            <p>
              <strong>Якісні зображення для простого вибору.</strong>
              <br />
              Усі товари мають детальні фото, що допоможуть вам оцінити їх
              вигляд і уявити у власному просторі.
            </p>

            <p>
              <strong>Корисна інформація та поради.</strong>
              <br />У нашому блозі ви знайдете статті з корисними лайфхаками,
              оглядами продукції та рекомендаціями щодо догляду за виробами.
            </p>

            <p>
              <strong>Бонуси та акції.</strong>
              <br />
              Щотижня ми пропонуємо спеціальні знижки, вигідні пропозиції та
              акційні товари. Підписуйтесь на нас у соціальних мережах, щоб бути
              в курсі всіх новинок!
            </p>

            <p>
              <strong>Швидкі та зручні покупки.</strong>
              <br />
              Бажаєте наповнити свій дім корисними та красивими речами без
              зайвого клопоту? Оформлюйте замовлення в нашому інтернет-магазині
              — це швидко, надійно та вигідно!
            </p>

            <p>
              Готові до покупок? Обирайте категорію, що вас цікавить, та
              насолоджуйтесь шопінгом разом з <strong>miydim.shop</strong>!
            </p>
          </div>
        </section>
      </section>
    </main>
  );
}
