"use client";

import styles from "./page.module.css";

export default function PrivacyPolicyPage() {
  return (
    <main className={styles.mainWrapper}>
      <section className={styles.contentWrapper}>
        <section className={styles.blueTheme}>
          <h2 className={styles.title}>Політика конфіденційності</h2>
        </section>

        <section>
          <div className={styles.container}>
            <p>
              Адміністрація сайту (далі Сайт) з повагою ставиться до прав
              відвідувачів Сайту. Ми беззастережно визнаємо важливість
              конфіденційності особистої інформації відвідувачів сайту.
            </p>

            <h3>ХТО Є АДМІНІСТРАТОРОМ ВАШИХ ПЕРСОНАЛЬНИХ ДАНИХ?</h3>
            <p>
              Адміністратором персональних даних, зібраних за допомогою:
              Інтернет-магазину, інших каналів комунікації або активності
              клієнта в Інтернеті є ФОП Герман Р. ЄДРПОУ 4323453122. Адреса:
              Сонячний провулок, 4, Житомир, 10014. Email: office@miydim.shop.
            </p>

            <p>
              З нашим інспектором охорони персональних даних можна
              зв&apos;язатися електронною поштою: office@miydim.shop.
            </p>

            <p>
              Персональні дані Клієнта обробляються згідно з GDPR, а також
              іншими нормативними актами. «Персональні дані» означають будь-яку
              інформацію, що стосується фізичної особи, яку ідентифіковано чи
              можна ідентифікувати.
            </p>

            <p>
              Адміністратор здійснює захист даних користувачів Інтернет-магазину
              та інших каналів комунікації, включаючи Facebook
              (https://www.facebook.com/legal/terms) та сервіси Facebook Lead
              Ads.
            </p>

            <h3>З ЯКОЮ МЕТОЮ І НА ЯКІЙ ПІДСТАВІ МИ ОБРОБЛЯЄМО ВАШІ ДАНІ?</h3>
            <p>
              Ми обробляємо Ваші персональні дані для виконання договорів,
              маркетингу, аналітики, покращення сервісу, юридичних
              обов&apos;язків, захисту інтересів.
            </p>

            <h3>КОНТАКТНИЙ ФОРМУЛЯР</h3>
            <p>
              Дані з контактного формуляра обробляються для: комунікації,
              укладення договору, аналітики, захисту прав. Підстава — законний
              інтерес, згода або юридичне зобов’язання.
            </p>

            <p>
              Надання даних є добровільним, але необхідним для комунікації.
              Термін зберігання — до завершення взаємодії або згідно з законом.
            </p>

            <h3>ЯКІ ВИ МАЄТЕ ПРАВА ТА ОБОВ’ЯЗКИ?</h3>
            <ul>
              <li>Подати скаргу на обробку персональних даних</li>
              <li>
                Передача, доступ, редагування, видалення, обмеження обробки
              </li>
              <li>Анулювання згоди</li>
              <li>Заперечення проти обробки для маркетингу</li>
            </ul>

            <h3>ДОДАТКОВА ІНФОРМАЦІЯ</h3>
            <p>
              Ми не передаємо вашу особисту інформацію третім особам, крім
              випадків, передбачених законодавством.
            </p>

            <h3>ПОЛІТИКА ЩОДО ФАЙЛІВ COOKIE</h3>

            <h3>Що таке файли cookie?</h3>
            <p>
              Це технології, що зберігають і отримують інформацію під час
              перегляду сайту, наприклад, для авторизації або персоналізації
              контенту.
            </p>

            <h3>Для чого ми використовуємо cookie?</h3>
            <ul>
              <li>
                <strong>Аналітичні:</strong> статистика, відвідуваність
              </li>
              <li>
                <strong>Рекламні:</strong> персоналізована реклама за поведінкою
              </li>
            </ul>

            <h3>Хто використовує cookie на сайті?</h3>
            <table>
              <thead>
                <tr>
                  <th>Суб&apos;єкт</th>
                  <th>Тип</th>
                  <th>Призначення</th>
                  <th>Інфо</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>Google Analytics</td>
                  <td>Сторонні</td>
                  <td>Статистика, реклама, профілі</td>
                  <td>
                    <a href="https://www.google.com/analytics/">
                      Google Analytics
                    </a>
                    ,{" "}
                    <a href="https://policies.google.com/privacy">
                      Privacy Center
                    </a>
                  </td>
                </tr>
              </tbody>
            </table>

            <h3>Як вимкнути cookie?</h3>
            <p>
              Ви можете вимкнути cookie в налаштуваннях вашого браузера. Для
              цього ознайомтесь з документацією вашого браузера або використайте
              додаток для блокування аналітики:{" "}
              <a href="https://tools.google.com/dlpage/gaoptout">GA Opt-Out</a>
            </p>

            <h3>Здійснення прав</h3>
            <p>
              Щоб реалізувати свої права, зверніться до нас через{" "}
              <a href="mailto:office@miydim.shop">office@miydim.shop</a>.
            </p>
          </div>
        </section>
      </section>
    </main>
  );
}
